{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "import re\n",
    "from tqdm.notebook import tqdm\n",
    "import neo4j\n",
    "from neo4j import GraphDatabase\n",
    "import os\n",
    "from neo4j_graphrag.experimental.components.embedder import TextChunkEmbedder\n",
    "from neo4j_graphrag.embeddings.openai import OpenAIEmbeddings\n",
    "from neo4j_graphrag.embeddings.ollama import OllamaEmbeddings\n",
    "from neo4j_graphrag.experimental.components.types import TextChunks, TextChunk\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Original code to load the graph data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "df=pd.read_csv(\"Data/ADV_GRAPH_20240119.csv\")\n",
    "ls_text=[]\n",
    "ls_index=[]\n",
    "ls_graph=[]\n",
    "# (start_node, edge, end_node)\n",
    "ls_start_node=[]\n",
    "ls_edge=[]\n",
    "ls_end_node=[]\n",
    "ls_len=[]\n",
    "for index, row in df.iterrows():\n",
    "    # Original string\n",
    "    s = row[\"Graph\"]\n",
    "    if s.startswith(\"ERROR:\"):\n",
    "        continue \n",
    "    # Use regex to find all phrases in parentheses\n",
    "    matches = re.findall(r'\\((.*?)\\)', s)\n",
    "    # Format each match by removing commas and stripping whitespace\n",
    "    ls_index+=[index for match in matches]\n",
    "    ls_text+=[' '.join(match.split(',')) for match in matches]\n",
    "    ls_graph+=matches\n",
    "    ls_len+=[len(match.split(',')) for match in matches]\n",
    "    for match in matches:\n",
    "        temp=match.split(',')\n",
    "        if len(temp)==3:\n",
    "            ls_start_node.append(temp[0])\n",
    "            ls_edge.append(temp[1])\n",
    "            ls_end_node.append(temp[2])\n",
    "        else:\n",
    "            ls_start_node.append(\"\")\n",
    "            ls_edge.append(\"\")\n",
    "            ls_end_node.append(\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_map=pd.DataFrame({\n",
    "    \"original_index\":ls_index,\n",
    "    \"graph\":ls_graph,\n",
    "    \"text\":ls_text,\n",
    "    \"len\":ls_len,\n",
    "    \"start_node\":ls_start_node,\n",
    "    \"edge\":ls_edge,\n",
    "    \"end_node\":ls_end_node\n",
    "})\n",
    "df_map=df_map[df_map.len==3].drop(columns=\"len\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "df_map[\"start_node\"]=df_map[\"start_node\"].apply(lambda x: ' '.join(str(x. lower()).split()) if isinstance(x, str) else x)\n",
    "df_map[\"edge\"]=df_map[\"edge\"].apply(lambda x: ' '.join(str(x. lower()).split()) if isinstance(x, str) else x)\n",
    "df_map[\"end_node\"]=df_map[\"end_node\"].apply(lambda x: ' '.join(str(x. lower()).split()) if isinstance(x, str) else x)\n",
    "df_map[\"text\"]=df_map[\"text\"].apply(lambda x: ' '.join(str(x).split()) if isinstance(x, str) else x)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "9bc240e9e54d4c56b11b00d48bcb1a56",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "  0%|          | 0/3015 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "minorities=df_map[\"start_node\"].unique()\n",
    "adj_nodes={minority: \n",
    "            set(df_map[(df_map[\"start_node\"]==minority) & (df_map[\"end_node\"].isin(minorities))][\"end_node\"]) \n",
    "            | \n",
    "            set(df_map[(df_map[\"end_node\"]==minority) & (df_map[\"start_node\"].isin(minorities))][\"start_node\"])\n",
    "            for minority in tqdm(minorities)}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>original_index</th>\n",
       "      <th>graph</th>\n",
       "      <th>text</th>\n",
       "      <th>start_node</th>\n",
       "      <th>edge</th>\n",
       "      <th>end_node</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>black folks, are, well endowed</td>\n",
       "      <td>black folks are well endowed</td>\n",
       "      <td>black folks</td>\n",
       "      <td>are</td>\n",
       "      <td>well endowed</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>good blacks, belong to, black people</td>\n",
       "      <td>good blacks belong to black people</td>\n",
       "      <td>good blacks</td>\n",
       "      <td>belong to</td>\n",
       "      <td>black people</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   original_index                                 graph  \\\n",
       "0               0        black folks, are, well endowed   \n",
       "1               1  good blacks, belong to, black people   \n",
       "\n",
       "                                 text   start_node       edge      end_node  \n",
       "0        black folks are well endowed  black folks        are  well endowed  \n",
       "1  good blacks belong to black people  good blacks  belong to  black people  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_map.head(2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>original_index</th>\n",
       "      <th>graph</th>\n",
       "      <th>text</th>\n",
       "      <th>start_node</th>\n",
       "      <th>edge</th>\n",
       "      <th>end_node</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>161</th>\n",
       "      <td>101</td>\n",
       "      <td>black people, overreact,</td>\n",
       "      <td>black people overreact</td>\n",
       "      <td>black people</td>\n",
       "      <td>overreact</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>135</td>\n",
       "      <td>black folks, don't fit in,</td>\n",
       "      <td>black folks don't fit in</td>\n",
       "      <td>black folks</td>\n",
       "      <td>don't fit in</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>592</th>\n",
       "      <td>401</td>\n",
       "      <td>black folks, haven't evolved fully,</td>\n",
       "      <td>black folks haven't evolved fully</td>\n",
       "      <td>black folks</td>\n",
       "      <td>haven't evolved fully</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>963</th>\n",
       "      <td>651</td>\n",
       "      <td>black folks, sleep around,</td>\n",
       "      <td>black folks sleep around</td>\n",
       "      <td>black folks</td>\n",
       "      <td>sleep around</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1003</th>\n",
       "      <td>679</td>\n",
       "      <td>black people, shoot,</td>\n",
       "      <td>black people shoot</td>\n",
       "      <td>black people</td>\n",
       "      <td>shoot</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48506</th>\n",
       "      <td>24495</td>\n",
       "      <td>Nigerian folks, don't live long,</td>\n",
       "      <td>Nigerian folks don't live long</td>\n",
       "      <td>nigerian folks</td>\n",
       "      <td>don't live long</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48856</th>\n",
       "      <td>24658</td>\n",
       "      <td>emo kids, cry,</td>\n",
       "      <td>emo kids cry</td>\n",
       "      <td>emo kids</td>\n",
       "      <td>cry</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49588</th>\n",
       "      <td>24955</td>\n",
       "      <td>bisexual women, don't exist,</td>\n",
       "      <td>bisexual women don't exist</td>\n",
       "      <td>bisexual women</td>\n",
       "      <td>don't exist</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49591</th>\n",
       "      <td>24955</td>\n",
       "      <td>bisexual men, don't exist,</td>\n",
       "      <td>bisexual men don't exist</td>\n",
       "      <td>bisexual men</td>\n",
       "      <td>don't exist</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50969</th>\n",
       "      <td>25442</td>\n",
       "      <td>europeans, won't listen,</td>\n",
       "      <td>europeans won't listen</td>\n",
       "      <td>europeans</td>\n",
       "      <td>won't listen</td>\n",
       "      <td></td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>109 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       original_index                                graph  \\\n",
       "161               101            black people, overreact,    \n",
       "208               135          black folks, don't fit in,    \n",
       "592               401  black folks, haven't evolved fully,   \n",
       "963               651          black folks, sleep around,    \n",
       "1003              679                 black people, shoot,   \n",
       "...               ...                                  ...   \n",
       "48506           24495    Nigerian folks, don't live long,    \n",
       "48856           24658                      emo kids, cry,    \n",
       "49588           24955         bisexual women, don't exist,   \n",
       "49591           24955           bisexual men, don't exist,   \n",
       "50969           25442            europeans, won't listen,    \n",
       "\n",
       "                                    text      start_node  \\\n",
       "161               black people overreact    black people   \n",
       "208             black folks don't fit in     black folks   \n",
       "592    black folks haven't evolved fully     black folks   \n",
       "963             black folks sleep around     black folks   \n",
       "1003                  black people shoot    black people   \n",
       "...                                  ...             ...   \n",
       "48506     Nigerian folks don't live long  nigerian folks   \n",
       "48856                       emo kids cry        emo kids   \n",
       "49588         bisexual women don't exist  bisexual women   \n",
       "49591           bisexual men don't exist    bisexual men   \n",
       "50969             europeans won't listen       europeans   \n",
       "\n",
       "                        edge end_node  \n",
       "161                overreact           \n",
       "208             don't fit in           \n",
       "592    haven't evolved fully           \n",
       "963             sleep around           \n",
       "1003                   shoot           \n",
       "...                      ...      ...  \n",
       "48506        don't live long           \n",
       "48856                    cry           \n",
       "49588            don't exist           \n",
       "49591            don't exist           \n",
       "50969           won't listen           \n",
       "\n",
       "[109 rows x 6 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# find empty nodes\n",
    "df_map[(df_map[\"start_node\"]==\"\") | (df_map[\"edge\"]==\"\") | (df_map[\"end_node\"]==\"\")]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_embeddings(start_node, end_node, edge):\n",
    "    ollama_embedder = OllamaEmbeddings(model=\"nomic-embed-text\")\n",
    "    \n",
    "    start_embedding = ollama_embedder.embed_query(start_node)\n",
    "    if end_node == \"\":\n",
    "        end_embedding = np.zeros(len(start_embedding))\n",
    "    else:\n",
    "        end_embedding = ollama_embedder.embed_query(end_node)\n",
    "    edge_embedding = ollama_embedder.embed_query(edge)\n",
    "\n",
    "    return start_embedding, end_embedding, edge_embedding"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Upload to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# neo4j_uri = os.getenv(\"NEO4J_URI\")\n",
    "# neo4j_user = os.getenv(\"NEO4J_USER\")\n",
    "# neo4j_password = os.getenv(\"NEO4J_PASSWORD\")\n",
    "neo4j_uri = \"bolt://localhost:7687\"\n",
    "neo4j_user= \"neo4j\"\n",
    "neo4j_password = \"medicalgraphrag\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "def run_query(driver, query, parameters=None):\n",
    "        \"\"\"\n",
    "        Executes a Cypher query against the Neo4j database.\n",
    "\n",
    "        Args:\n",
    "            query (str): The Cypher query to execute.\n",
    "\n",
    "        Returns:\n",
    "            list: A list of query results, where each result is a dictionary.\n",
    "        \"\"\"\n",
    "        with driver.session() as session:\n",
    "            result = session.run(query, parameters)\n",
    "            return [record.data() for record in result]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# docker-compose.yml\n",
    "# services:\n",
    "#   neo4j:\n",
    "#     container_name: neo4j\n",
    "#     image: neo4j:latest\n",
    "#     ports:\n",
    "#       - 7474:7474\n",
    "#       - 7687:7687\n",
    "#     environment:\n",
    "#       - NEO4J_AUTH=neo4j/${NEO4J_PASSWORD}\n",
    "#       - NEO4J_apoc_export_file_enabled=true\n",
    "#       - NEO4J_apoc_import_file_enabled=true\n",
    "#       - NEO4J_apoc_import_file_use__neo4j__config=true\n",
    "#       - NEO4J_PLUGINS=[\"apoc\", \"graph-data-science\"]\n",
    "#     volumes:\n",
    "#       - ./neo4j_db/data:/data\n",
    "#       - ./neo4j_db/logs:/logs\n",
    "#       - ./neo4j_db/import:/var/lib/neo4j/import\n",
    "#       - ./neo4j_db/plugins:/plugins"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'count(n)': 15044}]\n"
     ]
    }
   ],
   "source": [
    "neo4j_driver = GraphDatabase.driver(neo4j_uri, auth=(neo4j_user, neo4j_password))\n",
    "# query = \"\"\"\n",
    "#     MATCH (n)-[r]-(m)\n",
    "#     DELETE (r), (n), (m)\n",
    "# \"\"\"\n",
    "# query = \"\"\"\n",
    "#     MATCH (n)\n",
    "#     DELETE (n)\n",
    "# \"\"\"\n",
    "query = \"\"\"\n",
    "    MATCH (n)\n",
    "    RETURN count(n)\n",
    "\"\"\"\n",
    "print(run_query(neo4j_driver, query))\n",
    "\n",
    "neo4j_driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "100\n",
      "200\n",
      "300\n",
      "400\n",
      "500\n",
      "600\n",
      "700\n",
      "800\n",
      "900\n",
      "1000\n",
      "1100\n",
      "1200\n",
      "1300\n",
      "1400\n",
      "1500\n",
      "1600\n",
      "1700\n",
      "1800\n",
      "1900\n",
      "2000\n",
      "2100\n",
      "2200\n",
      "2300\n",
      "2400\n",
      "2500\n",
      "2600\n",
      "2700\n",
      "2800\n",
      "2900\n",
      "3000\n",
      "3100\n",
      "3200\n",
      "3300\n",
      "3400\n",
      "3500\n",
      "3600\n",
      "3700\n",
      "3800\n",
      "3900\n",
      "4000\n",
      "4100\n",
      "4200\n",
      "4300\n",
      "4400\n",
      "4500\n",
      "4600\n",
      "4700\n",
      "4800\n",
      "4900\n",
      "5000\n",
      "5100\n",
      "5200\n",
      "5300\n",
      "5400\n",
      "5500\n",
      "5600\n",
      "5700\n",
      "5800\n",
      "5900\n",
      "6000\n",
      "6100\n",
      "6200\n",
      "6300\n",
      "6400\n",
      "6500\n",
      "6600\n",
      "6700\n",
      "6800\n",
      "6900\n",
      "7000\n",
      "7100\n",
      "7200\n",
      "7300\n",
      "7400\n",
      "7500\n",
      "7600\n",
      "7700\n",
      "7800\n",
      "7900\n",
      "8000\n",
      "8100\n",
      "8200\n",
      "8300\n",
      "8400\n",
      "8500\n",
      "8600\n",
      "8700\n",
      "8800\n",
      "8900\n",
      "9000\n",
      "9100\n",
      "9200\n",
      "9300\n",
      "9400\n",
      "9500\n",
      "9600\n",
      "9700\n",
      "9800\n",
      "9900\n",
      "10000\n",
      "10100\n",
      "10200\n",
      "10300\n",
      "10400\n",
      "10500\n",
      "10600\n",
      "10700\n",
      "10800\n",
      "10900\n",
      "11000\n",
      "11100\n",
      "11200\n",
      "11300\n",
      "11400\n",
      "11500\n",
      "11600\n",
      "11700\n",
      "11800\n",
      "11900\n",
      "12000\n",
      "12100\n",
      "12200\n",
      "12300\n",
      "12400\n",
      "12500\n",
      "12600\n",
      "12700\n",
      "12800\n",
      "12900\n",
      "13000\n",
      "13100\n",
      "13200\n",
      "13300\n",
      "13400\n",
      "13500\n",
      "13600\n",
      "13700\n",
      "13800\n",
      "13900\n",
      "14000\n",
      "14100\n",
      "14200\n",
      "14300\n",
      "14400\n",
      "14500\n",
      "14600\n",
      "14700\n",
      "14800\n",
      "14900\n",
      "15100\n",
      "15200\n",
      "15300\n",
      "15400\n",
      "15500\n",
      "15600\n",
      "15700\n",
      "15800\n",
      "15900\n",
      "16000\n",
      "16100\n",
      "16200\n",
      "16300\n",
      "16400\n",
      "16500\n",
      "16600\n",
      "16700\n",
      "16800\n",
      "16900\n",
      "17000\n",
      "17100\n",
      "17200\n",
      "17300\n",
      "17400\n",
      "17500\n",
      "17600\n",
      "17700\n",
      "17800\n",
      "17900\n",
      "18000\n",
      "18100\n",
      "18200\n",
      "18300\n",
      "18400\n",
      "18500\n",
      "18600\n",
      "18700\n",
      "18800\n",
      "18900\n",
      "19000\n",
      "19100\n",
      "19200\n",
      "19300\n",
      "19400\n",
      "19500\n",
      "19600\n",
      "19700\n",
      "19800\n",
      "19900\n",
      "20000\n",
      "20100\n",
      "20200\n",
      "20300\n",
      "20400\n",
      "20500\n",
      "20600\n",
      "20700\n",
      "20800\n",
      "20900\n",
      "21000\n",
      "21100\n",
      "21200\n",
      "21300\n",
      "21400\n",
      "21500\n",
      "21600\n",
      "21700\n",
      "21800\n",
      "21900\n",
      "22000\n",
      "22100\n",
      "22200\n",
      "22300\n",
      "22400\n",
      "22500\n",
      "22600\n",
      "22700\n",
      "22800\n",
      "22900\n",
      "23000\n",
      "23100\n",
      "23200\n",
      "23300\n",
      "23400\n",
      "23500\n",
      "23600\n",
      "23700\n",
      "23800\n",
      "23900\n",
      "24000\n",
      "24100\n",
      "24200\n",
      "24300\n",
      "24400\n",
      "24500\n",
      "24600\n",
      "24700\n",
      "24800\n",
      "24900\n",
      "25000\n",
      "25100\n",
      "25200\n",
      "25300\n",
      "25400\n",
      "25500\n",
      "25600\n",
      "25700\n",
      "25800\n",
      "25900\n",
      "26000\n",
      "26100\n",
      "26200\n",
      "26300\n",
      "26400\n",
      "26500\n",
      "26600\n",
      "26700\n",
      "26800\n",
      "26900\n",
      "27000\n",
      "27100\n",
      "27200\n",
      "27300\n",
      "27400\n",
      "27500\n",
      "27600\n",
      "27700\n",
      "27800\n",
      "27900\n",
      "28000\n",
      "28100\n",
      "28200\n",
      "28300\n",
      "28400\n",
      "28500\n",
      "28600\n",
      "28700\n",
      "28800\n",
      "28900\n",
      "29000\n",
      "29100\n",
      "29200\n",
      "29300\n",
      "29400\n",
      "29500\n",
      "29600\n",
      "29700\n",
      "29800\n",
      "29900\n",
      "30000\n",
      "30100\n",
      "30200\n",
      "30300\n",
      "30400\n",
      "30500\n",
      "30600\n",
      "30700\n",
      "30800\n",
      "30900\n",
      "31000\n",
      "31100\n",
      "31200\n",
      "31300\n",
      "31400\n",
      "31500\n",
      "31600\n",
      "31700\n",
      "31800\n",
      "31900\n",
      "32000\n",
      "32100\n",
      "32200\n",
      "32300\n",
      "32400\n",
      "32500\n",
      "32600\n",
      "32700\n",
      "32800\n",
      "32900\n",
      "33000\n",
      "33100\n",
      "33200\n",
      "33300\n",
      "33400\n",
      "33500\n",
      "33600\n",
      "33700\n",
      "33800\n",
      "33900\n",
      "34000\n",
      "34100\n",
      "34200\n",
      "34300\n",
      "34400\n",
      "34500\n",
      "34600\n",
      "34700\n",
      "34800\n",
      "34900\n",
      "35000\n",
      "35100\n",
      "35200\n",
      "35300\n",
      "35400\n",
      "35500\n",
      "35600\n",
      "35700\n",
      "35800\n",
      "35900\n",
      "36000\n",
      "36100\n",
      "36200\n",
      "36300\n",
      "36400\n",
      "36500\n",
      "36600\n",
      "36700\n",
      "36800\n",
      "36900\n",
      "37000\n",
      "37100\n",
      "37200\n",
      "37300\n",
      "37400\n",
      "37500\n",
      "37600\n",
      "37700\n",
      "37800\n",
      "37900\n",
      "38000\n",
      "38100\n",
      "38200\n",
      "38300\n",
      "38400\n",
      "38500\n",
      "38600\n",
      "38700\n",
      "38800\n",
      "38900\n",
      "39000\n",
      "39100\n",
      "39200\n",
      "39300\n",
      "39400\n",
      "39500\n",
      "39600\n",
      "39700\n",
      "39800\n",
      "39900\n",
      "40000\n",
      "40100\n",
      "40200\n",
      "40300\n",
      "40400\n",
      "40500\n",
      "40600\n",
      "40700\n",
      "40800\n",
      "40900\n",
      "41000\n",
      "41100\n",
      "41200\n",
      "41300\n",
      "41400\n",
      "41500\n",
      "41600\n",
      "41700\n",
      "41800\n",
      "41900\n",
      "42000\n",
      "42100\n",
      "42200\n",
      "42300\n",
      "42400\n",
      "42500\n",
      "42600\n",
      "42700\n",
      "42800\n",
      "42900\n",
      "43000\n",
      "43100\n",
      "43200\n",
      "43300\n",
      "43400\n",
      "43500\n",
      "43600\n",
      "43700\n",
      "43800\n",
      "43900\n",
      "44000\n",
      "44100\n",
      "44200\n",
      "44300\n",
      "44400\n",
      "44500\n",
      "44600\n",
      "44700\n",
      "44800\n",
      "44900\n",
      "45000\n",
      "45100\n",
      "45200\n",
      "45300\n",
      "45400\n",
      "45500\n",
      "45600\n",
      "45700\n",
      "45800\n",
      "45900\n",
      "46000\n",
      "46100\n",
      "46200\n",
      "46300\n",
      "46400\n",
      "46500\n",
      "46600\n",
      "46700\n",
      "46800\n",
      "46900\n",
      "47000\n",
      "47100\n",
      "47200\n",
      "47300\n",
      "47400\n",
      "47500\n",
      "47600\n",
      "47700\n",
      "47800\n",
      "47900\n",
      "48000\n",
      "48100\n",
      "48200\n",
      "48300\n",
      "48400\n",
      "48500\n",
      "48600\n",
      "48700\n",
      "48800\n",
      "48900\n",
      "49000\n",
      "49100\n",
      "49200\n",
      "49300\n",
      "49400\n",
      "49500\n",
      "49600\n",
      "49700\n",
      "49800\n",
      "49900\n",
      "50000\n",
      "50100\n",
      "50200\n",
      "50300\n",
      "50400\n",
      "50500\n",
      "50600\n",
      "50700\n",
      "50800\n",
      "50900\n",
      "51000\n",
      "51100\n",
      "51200\n",
      "51300\n",
      "51400\n"
     ]
    }
   ],
   "source": [
    "neo4j_driver = GraphDatabase.driver(neo4j_uri, auth=(neo4j_user, neo4j_password))\n",
    "\n",
    "for row in df_map.iterrows():\n",
    "    #print every 1000 rows\n",
    "    if row[0] % 100 == 0:\n",
    "        print(row[0])\n",
    "    start_node=row[1][\"start_node\"]\n",
    "    end_node=row[1][\"end_node\"]\n",
    "    edge=row[1][\"edge\"]\n",
    "    start_embedding, end_embedding, edge_embedding = get_embeddings(start_node, end_node, edge)\n",
    "    query=\"\"\"MERGE (s:StartNode {text: $start_node})\n",
    "                MERGE (e:EndNode {text: $end_node}) \n",
    "                MERGE (s)-[r:RELATIONSHIP {text: $edge}]->(e)\n",
    "                SET s.embedding = $start_embedding, e.embedding = $end_embedding, r.embedding = $edge_embedding\n",
    "                RETURN s, e, r\n",
    "        \"\"\"\n",
    "    parameters = {\"start_node\": start_node,\n",
    "                \"end_node\": end_node,\n",
    "                \"edge\": edge,\n",
    "                \"start_embedding\": start_embedding,\n",
    "                \"end_embedding\": end_embedding,\n",
    "                \"edge_embedding\": edge_embedding}\n",
    "    # Run the query\n",
    "    run_query(neo4j_driver, query, parameters)\n",
    "\n",
    "query_start_index = \"\"\"\n",
    "        CREATE VECTOR INDEX startIndex IF NOT EXISTS FOR (s:StartNode) ON s.embedding OPTIONS {indexConfig: {`vector.similarity_function`: 'cosine'} }\n",
    "        \"\"\"\n",
    "query_end_index = \"\"\"\n",
    "        CREATE VECTOR INDEX endIndex IF NOT EXISTS FOR (e:EndNode) ON e.embedding OPTIONS {indexConfig: {`vector.similarity_function`: 'cosine'} } \n",
    "        \"\"\"\n",
    "query_edge_index = \"\"\"\n",
    "        CREATE VECTOR INDEX edgeIndex IF NOT EXISTS FOR (r:RELATIONSHIP) ON r.embedding OPTIONS {indexConfig: {`vector.similarity_function`: 'cosine'} }\n",
    "        \"\"\"\n",
    "# Run the queries\n",
    "run_query(neo4j_driver, query_start_index)\n",
    "run_query(neo4j_driver, query_end_index)\n",
    "run_query(neo4j_driver, query_edge_index)\n",
    "\n",
    "neo4j_driver.close()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# start_node=df_map.iloc[1][\"start_node\"]\n",
    "# end_node=df_map.iloc[1][\"end_node\"]\n",
    "# edge=df_map.iloc[1][\"edge\"]\n",
    "# print(start_node, end_node, edge)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# neo4j_driver = GraphDatabase.driver(neo4j_uri, auth=(neo4j_user, neo4j_password))\n",
    "# query = \"\"\"MERGE (s:StartNode {text: $start_node})\n",
    "#             MERGE (e:Endnode {text: $end_node}) \n",
    "#             WITH s, e\n",
    "#             CALL apoc.create.relationship(s, $edge, {}, e) YIELD rel\n",
    "#             RETURN s, e, rel\"\"\"\n",
    "# parameters = {\"start_node\": start_node,\n",
    "#                 \"end_node\": end_node,\n",
    "#                 \"edge\": edge}\n",
    "# results = run_query(neo4j_driver, query, parameters)\n",
    "# print(results)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "env",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
